{
  "metadata": {
    "total_size": 230025216
  },
  "weight_map": {
    "cls.predictions.bias": "pytorch_model-00003-of-00003.bin",
    "cls.predictions.decoder.bias": "pytorch_model-00003-of-00003.bin",
    "cls.predictions.decoder.weight": "pytorch_model-00001-of-00003.bin",
    "cls.predictions.transform.LayerNorm.bias": "pytorch_model-00003-of-00003.bin",
    "cls.predictions.transform.LayerNorm.weight": "pytorch_model-00003-of-00003.bin",
    "cls.predictions.transform.dense.bias": "pytorch_model-00003-of-00003.bin",
    "cls.predictions.transform.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.embeddings.LayerNorm.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.LayerNorm.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.h_position_embeddings.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.position_embeddings.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.position_ids": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.token_type_embeddings.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.w_position_embeddings.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.word_embeddings.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.x_position_embeddings.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.embeddings.y_position_embeddings.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.output.LayerNorm.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.output.LayerNorm.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.output.dense.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.output.dense.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.self.key.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.self.key.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.self.query.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.self.query.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.self.value.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.attention.self.value.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.intermediate.dense.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.intermediate.dense.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.output.LayerNorm.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.output.LayerNorm.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.output.dense.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.0.output.dense.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.output.LayerNorm.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.output.LayerNorm.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.output.dense.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.output.dense.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.self.key.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.self.key.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.self.query.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.self.query.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.self.value.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.attention.self.value.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.intermediate.dense.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.intermediate.dense.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.output.LayerNorm.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.output.LayerNorm.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.output.dense.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.1.output.dense.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.output.LayerNorm.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.output.LayerNorm.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.output.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.output.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.self.key.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.self.key.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.self.query.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.self.query.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.self.value.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.attention.self.value.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.intermediate.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.intermediate.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.output.LayerNorm.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.output.LayerNorm.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.output.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.10.output.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.output.LayerNorm.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.output.LayerNorm.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.output.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.output.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.self.key.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.self.key.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.self.query.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.self.query.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.self.value.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.attention.self.value.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.intermediate.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.intermediate.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.output.LayerNorm.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.output.LayerNorm.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.output.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.11.output.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.self.key.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.self.key.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.self.query.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.self.query.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.self.value.bias": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.2.attention.self.value.weight": "pytorch_model-00001-of-00003.bin",
    "layoutlm.encoder.layer.2.intermediate.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.intermediate.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.2.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.self.key.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.self.key.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.self.query.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.self.query.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.self.value.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.attention.self.value.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.intermediate.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.intermediate.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.3.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.self.key.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.self.key.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.self.query.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.self.query.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.self.value.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.attention.self.value.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.intermediate.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.intermediate.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.4.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.self.key.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.self.key.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.self.query.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.self.query.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.self.value.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.attention.self.value.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.intermediate.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.intermediate.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.5.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.self.key.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.self.key.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.self.query.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.self.query.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.self.value.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.attention.self.value.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.intermediate.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.intermediate.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.6.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.self.key.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.self.key.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.self.query.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.self.query.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.self.value.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.attention.self.value.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.intermediate.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.intermediate.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.7.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.output.LayerNorm.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.output.LayerNorm.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.output.dense.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.output.dense.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.self.key.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.self.key.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.self.query.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.self.query.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.self.value.bias": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.attention.self.value.weight": "pytorch_model-00002-of-00003.bin",
    "layoutlm.encoder.layer.8.intermediate.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.8.intermediate.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.8.output.LayerNorm.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.8.output.LayerNorm.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.8.output.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.8.output.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.output.LayerNorm.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.output.LayerNorm.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.output.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.output.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.self.key.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.self.key.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.self.query.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.self.query.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.self.value.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.attention.self.value.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.intermediate.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.intermediate.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.output.LayerNorm.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.output.LayerNorm.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.output.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.encoder.layer.9.output.dense.weight": "pytorch_model-00003-of-00003.bin",
    "layoutlm.pooler.dense.bias": "pytorch_model-00003-of-00003.bin",
    "layoutlm.pooler.dense.weight": "pytorch_model-00003-of-00003.bin"
  }
}
