{
  "cls_token": "[CLS]",
  "do_basic_tokenize": true,
  "do_lower_case": false,
  "mask_token": "[MASK]",
  "name_or_path": "layoutlm-wikipedia-ja",
  "never_split": null,
  "pad_token": "[PAD]",
  "sep_token": "[SEP]",
  "strip_accents": false,
  "tokenize_chinese_chars": false,
  "tokenizer_class": "LayoutLMTokenizer",
  "unk_token": "[UNK]"
}
